xml/Xsip-Order-Entry.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:bses="http://bsestarmf.in/" xmlns:mfor="http://schemas.datacontract.org/2004/07/MFOrderService">
   <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
            <wsa:Action>http://bsestarmf.in/MFOrderEntry/xsipOrderEntry</wsa:Action>
            <wsa:To>https://bsestarmfdemo.bseindia.com/MFOrderEntry/MFOrder.svc/Secure</wsa:To>
     </soap:Header>
   <soap:Body>
      <bses:xsipOrderEntry>
         <bses:data>
            <mfor:Brokerage></mfor:Brokerage>
            <mfor:ClientCode></mfor:ClientCode>
            <mfor:DPC></mfor:DPC>
            <mfor:DpTxnMode></mfor:DpTxnMode>
            <mfor:Euin></mfor:Euin>
            <mfor:EuinVal></mfor:EuinVal>
            <mfor:FirstOrderFlag></mfor:FirstOrderFlag>
            <mfor:FolioNo></mfor:FolioNo>
            <mfor:FrequencyAllowed></mfor:FrequencyAllowed>
            <mfor:FrequencyType></mfor:FrequencyType>
            <mfor:IPAdd></mfor:IPAdd>
            <mfor:InstallmentAmount></mfor:InstallmentAmount>
            <mfor:InternalRefNo></mfor:InternalRefNo>
            <mfor:MandateID></mfor:MandateID>
            <mfor:MemberCode></mfor:MemberCode>
            <mfor:NoOfInstallment></mfor:NoOfInstallment>
            <mfor:Param1></mfor:Param1>
            <mfor:Param2></mfor:Param2>
            <mfor:Param3></mfor:Param3>
            <mfor:PassKey></mfor:PassKey>
            <mfor:Password></mfor:Password>
            <mfor:Remarks></mfor:Remarks>
            <mfor:SchemeCode></mfor:SchemeCode>
            <mfor:StartDate></mfor:StartDate>
            <mfor:SubberCode></mfor:SubberCode>
            <mfor:TransMode></mfor:TransMode>
            <mfor:TransactionCode></mfor:TransactionCode>
            <mfor:UniqueRefNo></mfor:UniqueRefNo>
            <mfor:UserId></mfor:UserId>
            <mfor:XsipRegID></mfor:XsipRegID>
         </bses:data>
      </bses:xsipOrderEntry>
   </soap:Body>
</soap:Envelope>